#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Validate ✅ `success`
#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```hcl
[command]/home/runner/work/_temp/4304aa03-09fb-4a7a-bdde-597b84889c66/terraform-bin plan -no-color
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./environments/dev relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/Terraform-Projects/Terraform-Projects/Terraform-3tier-Infra/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/Terraform-Projects/Terraform-Projects/Terraform-3tier-Infra

To view this run in a browser, visit:
https://app.terraform.io/app/Singhops/dev/runs/run-Pgs2rDA7nfyENSmV

Waiting for the plan to start...

Terraform v1.13.0
on linux_amd64
Initializing plugins and modules...
module.dns.data.aws_route53_zone.primary[0]: Refreshing...
module.iam.data.aws_caller_identity.current: Refreshing...
module.asg.data.aws_ami.linux: Refreshing...
module.monitoring.data.aws_caller_identity.current: Refreshing...
module.iam.data.aws_caller_identity.current: Refresh complete after 0s [id=789103393231]
module.monitoring.data.aws_caller_identity.current: Refresh complete after 0s [id=789103393231]
module.dns.data.aws_route53_zone.primary[0]: Refresh complete after 0s [id=Z0111471Z8E165DEP1B]
module.asg.data.aws_ami.linux: Refresh complete after 1s [id=ami-07c1fa5792ef8fe27]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.alb.aws_lb.alb will be created
  + resource "aws_lb" "alb" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = (known after apply)
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "App-ALB"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + region                                                       = "us-east-1"
      + secondary_ips_auto_assigned_per_subnet                       = (known after apply)
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags                                                         = {
          + "Environment" = "dev"
          + "Name"        = "App-ALB-dev"
          + "Owner"       = "Gursimran"
          + "Project"     = "terraform-aws-3tier-infra"
        }
      + tags_all                                                     = {
          + "Environment" = "dev"
          + "Name"        = "App-ALB-dev"
          + "Owner"       = "Gursimran"
          + "Project"     = "terraform-aws-3tier-infra"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + access_logs {
          + bucket  = (known after apply)
          + enabled = true
          + prefix  = "alb-logs"
        }

      + subnet_mapping (known after apply)
    }

  # module.alb.aws_lb_listener.alb_listener will be created
  + resource "aws_lb_listener" "alb_listener" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + region                                                                = "us-east-1"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags_all                                                              = (known after apply)
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # module.alb.aws_lb_target_group.tg will be created
  + resource "aws_lb_target_group" "tg" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "App-TG"
      + name_prefix                        = (known after apply)
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + region                             = "us-east-1"
      + slow_start                         = 0
      + tags                               = {
          + "Environment" = "dev"
          + "Name"        = "App-TG-dev"
          + "Owner"       = "Gursimran"
          + "Project"     = "terraform-aws-3tier-infra"
        }
      + tags_all                           = {
          + "Environment" = "dev"
          + "Name"        = "App-TG-dev"
          + "Owner"       = "Gursimran"
          + "Project"     = "terraform-aws-3tier-infra"
        }
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 5
          + interval            = 30
          + matcher             = "200-399"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # module.alb.aws_security_group.alb_sg will be created
  + resource "aws_security_group" "alb_sg" {
      + arn                    = (known after apply)
      + description            = "Security group for ALB"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "ALB-SG"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "us-east-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "dev"
          + "Name"        = "ALB-SG-dev"
          + "Owner"       = "Gursimran"
          + "Project"     = "terraform-aws-3tier-infra"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "Name"        = "ALB-SG-dev"
          + "Owner"       = "Gursimran"
          + "Project"     = "terraform-aws-3tier-infra"
        }
      + vpc_id                 = (known after apply)
    }

  # module.alb.aws_vpc_security_group_egress_rule.allow_http will be created
  + resource "aws_vpc_security_group_egress_rule" "allow_http" {
      + arn                          = (known after apply)
      + description                  = "Allow Outbound HTTP traffic from within ASG to ALB"
      + from_port                    = 80
      + id                           = (known after apply)
      + ip_protocol                  = "tcp"
      + referenced_security_group_id = (known after apply)
      + region                       = "us-east-1"
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
      + to_port                      = 80
    }

  # module.alb.aws_vpc_security_group_egress_rule.allow_https will be created
  + resource "aws_vpc_security_group_egress_rule" "allow_https" {
      + arn                          = (known after apply)
      + description                  = "Allow Outbound HTTPS traffic from within ASG to ALB"
      + from_port                    = 443
      + id                           = (known after apply)
      + ip_protocol                  = "tcp"
      + referenced_security_group_id = (known after apply)
      + region                       = "us-east-1"
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
      + to_port                      = 443
    }

  # module.alb.aws_vpc_security_group_ingress_rule.allow_http will be created
  + resource "aws_vpc_security_group_ingress_rule" "allow_http" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow HTTP traffic from anywhere"
      + from_port              = 80
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + region                 = "us-east-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
      + to_port                = 80
    }

  # module.alb.aws_vpc_security_group_ingress_rule.allow_https will be created
  + resource "aws_vpc_security_group_ingress_rule" "allow_https" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow HTTPS traffic from anywhere"
      + from_port              = 443
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + region                 = "us-east-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
      + to_port                = 443
    }

  # module.asg.aws_autoscaling_group.asg_app will be created
  + resource "aws_autoscaling_group" "asg_app" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 2
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = "ELB"
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 4
      + metrics_granularity              = "1Minute"
      + min_size                         = 2
      + name                             = (known after apply)
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + region                           = "us-east-1"
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = (known after apply)
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + availability_zone_distribution (known after apply)

      + capacity_reservation_specification (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + mixed_instances_policy (known after apply)

      + traffic_source (known after apply)
    }

  # module.asg.aws_launch_template.application will be created
  + resource "aws_launch_template" "application" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + id              = (known after apply)
      + image_id        = "ami-07c1fa5792ef8fe27"
      + instance_type   = "t2.micro"
      + key_name        = "my-ec2-key"
      + latest_version  = (known after apply)
      + name            = (known after apply)
      + name_prefix     = "APP-Launch-Template"
      + region          = "us-east-1"
      + tags            = {
          + "Environment" = "dev"
          + "Name"        = "ASG-LT-dev"
          + "Owner"       = "Gursimran"
          + "Project"     = "terraform-aws-3tier-infra"
        }
      + tags_all        = {
          + "Environment" = "dev"
          + "Name"        = "ASG-LT-dev"
          + "Owner"       = "Gursimran"
          + "Project"     = "terraform-aws-3tier-infra"
        }
      + user_data       = "IyEvYmluL2Jhc2gKc2V0IC1lCgojIFVwZGF0ZSBwYWNrYWdlcwpkbmYgdXBkYXRlIC15CgojIEluc3RhbGwgYW5kIHN0YXJ0IE5HSU5YCmRuZiBpbnN0YWxsIC15IG5naW54IC0tYWxsb3dlcmFzaW5nCnN5c3RlbWN0bCBlbmFibGUgbmdpbngKc3lzdGVtY3RsIHN0YXJ0IG5naW54CgojIEluc3RhbGwgQ2xvdWRXYXRjaCBBZ2VudApkbmYgaW5zdGFsbCAteSBhbWF6b24tY2xvdWR3YXRjaC1hZ2VudAoKIyBHZXQgaW5zdGFuY2UgSUQKSU5TVEFOQ0VfSUQ9JChjdXJsIC1zIGh0dHA6Ly8xNjkuMjU0LjE2OS4yNTQvbGF0ZXN0L21ldGEtZGF0YS9pbnN0YW5jZS1pZCkKCiMgQ2xvdWRXYXRjaCBjb25maWcKY2F0IDw8RU9UID4gL29wdC9hd3MvYW1hem9uLWNsb3Vkd2F0Y2gtYWdlbnQvZXRjL2FtYXpvbi1jbG91ZHdhdGNoLWFnZW50Lmpzb24KewogICJsb2dzIjogewogICAgImxvZ3NfY29sbGVjdGVkIjogewogICAgICAiZmlsZXMiOiB7CiAgICAgICAgImNvbGxlY3RfbGlzdCI6IFsKICAgICAgICAgIHsKICAgICAgICAgICAgImZpbGVfcGF0aCI6ICIvdmFyL2xvZy9uZ2lueC9hY2Nlc3MubG9nIiwKICAgICAgICAgICAgImxvZ19ncm91cF9uYW1lIjogIi9lYzIvYXNnLWFwcC1kZXYiLAogICAgICAgICAgICAibG9nX3N0cmVhbV9uYW1lIjogIntJTlNUQU5DRV9JRH0tbmdpbngtYWNjZXNzIgogICAgICAgICAgfSwKICAgICAgICAgIHsKICAgICAgICAgICAgImZpbGVfcGF0aCI6ICIvdmFyL2xvZy9uZ2lueC9lcnJvci5sb2ciLAogICAgICAgICAgICAibG9nX2dyb3VwX25hbWUiOiAiL2VjMi9hc2ctYXBwLWRldiIsCiAgICAgICAgICAgICJsb2dfc3RyZWFtX25hbWUiOiAie0lOU1RBTkNFX0lEfS1uZ2lueC1lcnJvciIKICAgICAgICAgIH0KICAgICAgICBdCiAgICAgIH0KICAgIH0KICB9Cn0KRU9UCgojIEVuYWJsZSBDbG91ZFdhdGNoIEFnZW50CnN5c3RlbWN0bCBlbmFibGUgYW1hem9uLWNsb3Vkd2F0Y2gtYWdlbnQKc3lzdGVtY3RsIHN0YXJ0IGFtYXpvbi1jbG91ZHdhdGNoLWFnZW50CgojIEVuc3VyZSBTU00gQWdlbnQgaXMgaW5zdGFsbGVkIChhbHJlYWR5IHByZXNlbnQgb24gQUwyMDIzLCBidXQganVzdCBpbiBjYXNlKQpkbmYgaW5zdGFsbCAteSBhbWF6b24tc3NtLWFnZW50IHx8IHRydWUKc3lzdGVtY3RsIGVuYWJsZSBhbWF6b24tc3NtLWFnZW50CnN5c3RlbWN0bCBzdGFydCBhbWF6b24tc3NtLWFnZW50Cg=="

      + iam_instance_profile {
          + arn = (known after apply)
        }

      + metadata_options (known after apply)

      + network_interfaces {
          + associate_public_ip_address = "false"
          + security_groups             = (known after apply)
        }
    }

  # module.asg.aws_security_group.asg_sg will be created
  + resource "aws_security_group" "asg_sg" {
      + arn                    = (known after apply)
      + description            = "Security group for ASG application instances"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "asg_app_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "us-east-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "dev"
          + "Name"        = "asg_app_sg-dev"
          + "Owner"       = "Gursimran"
          + "Project"     = "terraform-aws-3tier-infra"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "Name"        = "asg_app_sg-dev"
          + "Owner"       = "Gursimran"
          + "Project"     = "terraform-aws-3tier-infra"
        }
      + vpc_id                 = (known after apply)
    }

  # module.asg.aws_vpc_security_group_egress_rule.allow_http will be created
  + resource "aws_vpc_security_group_egress_rule" "allow_http" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow HTTP traffic outbound to connect to NAT"
      + from_port              = 80
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + region                 = "us-east-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
      + to_port                = 80
    }

  # module.asg.aws_vpc_security_group_egress_rule.allow_https will be created
  + resource "aws_vpc_security_group_egress_rule" "allow_https" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow HTTPS traffic outbound to connect to NAT"
      + from_port              = 443
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + region                 = "us-east-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
      + to_port                = 443
    }

  # module.asg.aws_vpc_security_group_ingress_rule.allow_http will be created
  + resource "aws_vpc_security_group_ingress_rule" "allow_http" {
      + arn                          = (known after apply)
      + description                  = "Allow HTTP traffic from within ASG to ALB"
      + from_port                    = 80
      + id                           = (known after apply)
      + ip_protocol                  = "tcp"
      + referenced_security_group_id = (known after apply)
      + region                       = "us-east-1"
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
      + to_port                      = 80
    }

  # module.asg.aws_vpc_security_group_ingress_rule.allow_https will be created
  + resource "aws_vpc_security_group_ingress_rule" "allow_https" {
      + arn                          = (known after apply)
      + description                  = "Allow HTTPS traffic from within ASG to ALB"
      + from_port                    = 443
      + id                           = (known after apply)
      + ip_protocol                  = "tcp"
      + referenced_security_group_id = (known after apply)
      + region                       = "us-east-1"
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
      + to_port                      = 443
    }

  # module.dns.aws_route53_record.root will be created
  + resource "aws_route53_record" "root" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "dev.singhops.net"
      + type            = "A"
      + zone_id         = "Z0111471Z8E165DEP1B"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.iam.aws_iam_instance_profile.ec2_instance_profile will be created
  + resource "aws_iam_instance_profile" "ec2_instance_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "EC2InstanceProfile-dev"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "ec2-role-dev"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.iam.aws_iam_policy.ssm_db_access will be created
  + resource "aws_iam_policy" "ssm_db_access" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allow EC2 to read DB password from SSM Parameter Store"
      + id               = (known after apply)
      + name             = "ssm-db-access-dev"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:GetParameter",
                          + "ssm:GetParameters",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ssm:us-east-1:789103393231:parameter/dev/db/password"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.iam.aws_iam_role.ec2_role will be created
  + resource "aws_iam_role" "ec2_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ec2-role-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "Name"        = "EC2Role-dev"
          + "Owner"       = "Gursimran"
          + "Project"     = "terraform-aws-3tier-infra"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "Name"        = "EC2Role-dev"
          + "Owner"       = "Gursimran"
          + "Project"     = "terraform-aws-3tier-infra"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam.aws_iam_role_policy_attachment.attach_ssm_db_access will be created
  + resource "aws_iam_role_policy_attachment" "attach_ssm_db_access" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ec2-role-dev"
    }

  # module.iam.aws_iam_role_policy_attachment.cw will be created
  + resource "aws_iam_role_policy_attachment" "cw" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/CloudWatchAgentServerPolicy"
      + role       = "ec2-role-dev"
    }

  # module.iam.aws_iam_role_policy_attachment.ssm_attach will be created
  + resource "aws_iam_role_policy_attachment" "ssm_attach" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "ec2-role-dev"
    }

  # module.monitoring.aws_cloudwatch_log_group.asg_log_group will be created
  + resource "aws_cloudwatch_log_group" "asg_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/ec2/asg-app-dev"
      + name_prefix       = (known after apply)
      + region            = "us-east-1"
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "dev"
          + "Name"        = "ASG-App-LogGroup-dev"
          + "Owner"       = "Gursimran"
          + "Project"     = "terraform-aws-3tier-infra"
        }
      + tags_all          = {
          + "Environment" = "dev"
          + "Name"        = "ASG-App-LogGroup-dev"
          + "Owner"       = "Gursimran"
          + "Project"     = "terraform-aws-3tier-infra"
        }
    }

  # module.monitoring.aws_s3_bucket.alb_logs will be created
  + resource "aws_s3_bucket" "alb_logs" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "us-east-1"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "dev"
          + "Name"        = "ALB-Logs-dev"
          + "Owner"       = "Gursimran"
          + "Project"     = "terraform-aws-3tier-infra"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "Name"        = "ALB-Logs-dev"
          + "Owner"       = "Gursimran"
          + "Project"     = "terraform-aws-3tier-infra"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.monitoring.aws_s3_bucket_policy.alb_logs will be created
  + resource "aws_s3_bucket_policy" "alb_logs" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
      + region = "us-east-1"
    }

  # module.monitoring.random_id.bucket_id will be created
  + resource "random_id" "bucket_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 6
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.vpc.aws_eip.nat_eip["us-east-1a"] will be created
  + resource "aws_eip" "nat_eip" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + region               = "us-east-1"
      + tags                 = {
          + "Environment" = "dev"
          + "Name"        = "NatEIP-us-east-1a-dev"
          + "Owner"       = "Gursimran"
          + "Project"     = "terraform-aws-3tier-infra"
        }
      + tags_all             = {
          + "Environment" = "dev"
          + "Name"        = "NatEIP-us-east-1a-dev"
          + "Owner"       = "Gursimran"
          + "Project"     = "terraform-aws-3tier-infra"
        }
    }

  # module.vpc.aws_eip.nat_eip["us-east-1b"] will be created
  + resource "aws_eip" "nat_eip" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + region               = "us-east-1"
      + tags                 = {
          + "Environment" = "dev"
          + "Name"        = "NatEIP-us-east-1b-dev"
          + "Owner"       = "Gursimran"
          + "Project"     = "terraform-aws-3tier-infra"
        }
      + tags_all             = {
          + "Environment" = "dev"
          + "Name"        = "NatEIP-us-east-1b-dev"
          + "Owner"       = "Gursimran"
          + "Project"     = "terraform-aws-3tier-infra"
        }
    }

  # module.vpc.aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + region   = "us-east-1"
      + tags     = {
          + "Environment" = "dev"
          + "Name"        = "IGW-VPCji-dev"
          + "Owner"       = "Gursimran"
          + "Project"     = "terraform-aws-3tier-infra"
        }
      + tags_all = {
          + "Environment" = "dev"
          + "Name"        = "IGW-VPCji-dev"
          + "Owner"       = "Gursimran"
          + "Project"     = "terraform-aws-3tier-infra"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.nat_gw["us-east-1a"] will be created
  + resource "aws_nat_gateway" "nat_gw" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + region                             = "us-east-1"
      + secondary_allocation_ids           = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Environment" = "dev"
          + "Name"        = "NatGW-us-east-1a-dev"
          + "Owner"       = "Gursimran"
          + "Project"     = "terraform-aws-3tier-infra"
        }
      + tags_all                           = {
          + "Environment" = "dev"
          + "Name"        = "NatGW-us-east-1a-dev"
          + "Owner"       = "Gursimran"
          + "Project"     = "terraform-aws-3tier-infra"
        }
    }

  # module.vpc.aws_nat_gateway.nat_gw["us-east-1b"] will be created
  + resource "aws_nat_gateway" "nat_gw" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + region                             = "us-east-1"
      + secondary_allocation_ids           = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Environment" = "dev"
          + "Name"        = "NatGW-us-east-1b-dev"
          + "Owner"       = "Gursimran"
          + "Project"     = "terraform-aws-3tier-infra"
        }
      + tags_all                           = {
          + "Environment" = "dev"
          + "Name"        = "NatGW-us-east-1b-dev"
          + "Owner"       = "Gursimran"
          + "Project"     = "terraform-aws-3tier-infra"
        }
    }

  # module.vpc.aws_route.app_rt_route["us-east-1a"] will be created
  + resource "aws_route" "app_rt_route" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + region                 = "us-east-1"
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.vpc.aws_route.app_rt_route["us-east-1b"] will be created
  + resource "aws_route" "app_rt_route" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + region                 = "us-east-1"
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.vpc.aws_route.public_rt_route will be created
  + resource "aws_route" "public_rt_route" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + region                 = "us-east-1"
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.vpc.aws_route_table.app_rt["us-east-1a"] will be created
  + resource "aws_route_table" "app_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "us-east-1"
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "Name"        = "AppRT-us-east-1a-dev"
          + "Owner"       = "Gursimran"
          + "Project"     = "terraform-aws-3tier-infra"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "Name"        = "AppRT-us-east-1a-dev"
          + "Owner"       = "Gursimran"
          + "Project"     = "terraform-aws-3tier-infra"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.app_rt["us-east-1b"] will be created
  + resource "aws_route_table" "app_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "us-east-1"
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "Name"        = "AppRT-us-east-1b-dev"
          + "Owner"       = "Gursimran"
          + "Project"     = "terraform-aws-3tier-infra"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "Name"        = "AppRT-us-east-1b-dev"
          + "Owner"       = "Gursimran"
          + "Project"     = "terraform-aws-3tier-infra"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.db_rt["us-east-1a"] will be created
  + resource "aws_route_table" "db_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "us-east-1"
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "Name"        = "DBRT-us-east-1a-dev"
          + "Owner"       = "Gursimran"
          + "Project"     = "terraform-aws-3tier-infra"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "Name"        = "DBRT-us-east-1a-dev"
          + "Owner"       = "Gursimran"
          + "Project"     = "terraform-aws-3tier-infra"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.db_rt["us-east-1b"] will be created
  + resource "aws_route_table" "db_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "us-east-1"
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "Name"        = "DBRT-us-east-1b-dev"
          + "Owner"       = "Gursimran"
          + "Project"     = "terraform-aws-3tier-infra"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "Name"        = "DBRT-us-east-1b-dev"
          + "Owner"       = "Gursimran"
          + "Project"     = "terraform-aws-3tier-infra"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public_rt will be created
  + resource "aws_route_table" "public_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "us-east-1"
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "Name"        = "PublicRT-dev"
          + "Owner"       = "Gursimran"
          + "Project"     = "terraform-aws-3tier-infra"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "Name"        = "PublicRT-dev"
          + "Owner"       = "Gursimran"
          + "Project"     = "terraform-aws-3tier-infra"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.app_rt_assoc["us-east-1a"] will be created
  + resource "aws_route_table_association" "app_rt_assoc" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.app_rt_assoc["us-east-1b"] will be created
  + resource "aws_route_table_association" "app_rt_assoc" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.db_rt_assoc["us-east-1a"] will be created
  + resource "aws_route_table_association" "db_rt_assoc" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.db_rt_assoc["us-east-1b"] will be created
  + resource "aws_route_table_association" "db_rt_assoc" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public_rt_assoc["us-east-1a"] will be created
  + resource "aws_route_table_association" "public_rt_assoc" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public_rt_assoc["us-east-1b"] will be created
  + resource "aws_route_table_association" "public_rt_assoc" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.app_subnets["us-east-1a"] will be created
  + resource "aws_subnet" "app_subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "AppSubnet-us-east-1a-dev"
          + "Owner"       = "Gursimran"
          + "Project"     = "terraform-aws-3tier-infra"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "AppSubnet-us-east-1a-dev"
          + "Owner"       = "Gursimran"
          + "Project"     = "terraform-aws-3tier-infra"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.app_subnets["us-east-1b"] will be created
  + resource "aws_subnet" "app_subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "AppSubnet-us-east-1b-dev"
          + "Owner"       = "Gursimran"
          + "Project"     = "terraform-aws-3tier-infra"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "AppSubnet-us-east-1b-dev"
          + "Owner"       = "Gursimran"
          + "Project"     = "terraform-aws-3tier-infra"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.db_subnets["us-east-1a"] will be created
  + resource "aws_subnet" "db_subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.5.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "DBSubnet-us-east-1a-dev"
          + "Owner"       = "Gursimran"
          + "Project"     = "terraform-aws-3tier-infra"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "DBSubnet-us-east-1a-dev"
          + "Owner"       = "Gursimran"
          + "Project"     = "terraform-aws-3tier-infra"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.db_subnets["us-east-1b"] will be created
  + resource "aws_subnet" "db_subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.6.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "DBSubnet-us-east-1b-dev"
          + "Owner"       = "Gursimran"
          + "Project"     = "terraform-aws-3tier-infra"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "DBSubnet-us-east-1b-dev"
          + "Owner"       = "Gursimran"
          + "Project"     = "terraform-aws-3tier-infra"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public_subnets["us-east-1a"] will be created
  + resource "aws_subnet" "public_subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "PublicSubnet-us-east-1a-dev"
          + "Owner"       = "Gursimran"
          + "Project"     = "terraform-aws-3tier-infra"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "PublicSubnet-us-east-1a-dev"
          + "Owner"       = "Gursimran"
          + "Project"     = "terraform-aws-3tier-infra"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public_subnets["us-east-1b"] will be created
  + resource "aws_subnet" "public_subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "PublicSubnet-us-east-1b-dev"
          + "Owner"       = "Gursimran"
          + "Project"     = "terraform-aws-3tier-infra"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "PublicSubnet-us-east-1b-dev"
          + "Owner"       = "Gursimran"
          + "Project"     = "terraform-aws-3tier-infra"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + region                               = "us-east-1"
      + tags                                 = {
          + "Environment" = "dev"
          + "Name"        = "VPCji-dev"
          + "Owner"       = "Gursimran"
          + "Project"     = "terraform-aws-3tier-infra"
        }
      + tags_all                             = {
          + "Environment" = "dev"
          + "Name"        = "VPCji-dev"
          + "Owner"       = "Gursimran"
          + "Project"     = "terraform-aws-3tier-infra"
        }
    }

Plan: 52 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + Domain_Website = (known after apply)
  + alb_website    = (known after apply)
  + cw_log_group   = "/ec2/asg-app-dev"
  + iam_profile    = (known after apply)
  + rds_endpoint   = "RDS not created"
  + s3_bucket_name = (known after apply)
  + vpc_id         = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 0.
::debug::stdout: Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C%0Awill stop streaming the logs, but will not stop the plan running remotely.%0A%0APreparing the remote plan...%0A%0AThe remote workspace is configured to work with configuration at%0A./environments/dev relative to the target repository.%0A%0ATerraform will upload the contents of the following directory,%0Aexcluding files or directories as defined by a .terraformignore file%0Aat /home/runner/work/Terraform-Projects/Terraform-Projects/Terraform-3tier-Infra/.terraformignore (if it is present),%0Ain order to capture the filesystem context the remote workspace expects:%0A    /home/runner/work/Terraform-Projects/Terraform-Projects/Terraform-3tier-Infra%0A%0ATo view this run in a browser, visit:%0Ahttps://app.terraform.io/app/Singhops/dev/runs/run-Pgs2rDA7nfyENSmV%0A%0AWaiting for the plan to start...%0A%0ATerraform v1.13.0%0Aon linux_amd64%0AInitializing plugins and modules...%0Amodule.dns.data.aws_route53_zone.primary[0]: Refreshing...%0Amodule.iam.data.aws_caller_identity.current: Refreshing...%0Amodule.asg.data.aws_ami.linux: Refreshing...%0Amodule.monitoring.data.aws_caller_identity.current: Refreshing...%0Amodule.iam.data.aws_caller_identity.current: Refresh complete after 0s [id=789103393231]%0Amodule.monitoring.data.aws_caller_identity.current: Refresh complete after 0s [id=789103393231]%0Amodule.dns.data.aws_route53_zone.primary[0]: Refresh complete after 0s [id=Z0111471Z8E165DEP1B]%0Amodule.asg.data.aws_ami.linux: Refresh complete after 1s [id=ami-07c1fa5792ef8fe27]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.alb.aws_lb.alb will be created%0A  + resource "aws_lb" "alb" {%0A      + arn                                                          = (known after apply)%0A      + arn_suffix                                                   = (known after apply)%0A      + client_keep_alive                                            = 3600%0A      + desync_mitigation_mode                                       = "defensive"%0A      + dns_name                                                     = (known after apply)%0A      + drop_invalid_header_fields                                   = false%0A      + enable_deletion_protection                                   = false%0A      + enable_http2                                                 = true%0A      + enable_tls_version_and_cipher_suite_headers                  = false%0A      + enable_waf_fail_open                                         = false%0A      + enable_xff_client_port                                       = false%0A      + enable_zonal_shift                                           = false%0A      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)%0A      + id                                                           = (known after apply)%0A      + idle_timeout                                                 = 60%0A      + internal                                                     = (known after apply)%0A      + ip_address_type                                              = (known after apply)%0A      + load_balancer_type                                           = "application"%0A      + name                                                         = "App-ALB"%0A      + name_prefix                                                  = (known after apply)%0A      + preserve_host_header                                         = false%0A      + region                                                       = "us-east-1"%0A      + secondary_ips_auto_assigned_per_subnet                       = (known after apply)%0A      + security_groups                                              = (known after apply)%0A      + subnets                                                      = (known after apply)%0A      + tags                                                         = {%0A          + "Environment" = "dev"%0A          + "Name"        = "App-ALB-dev"%0A          + "Owner"       = "Gursimran"%0A          + "Project"     = "terraform-aws-3tier-infra"%0A        }%0A      + tags_all                                                     = {%0A          + "Environment" = "dev"%0A          + "Name"        = "App-ALB-dev"%0A          + "Owner"       = "Gursimran"%0A          + "Project"     = "terraform-aws-3tier-infra"%0A        }%0A      + vpc_id                                                       = (known after apply)%0A      + xff_header_processing_mode                                   = "append"%0A      + zone_id                                                      = (known after apply)%0A%0A      + access_logs {%0A          + bucket  = (known after apply)%0A          + enabled = true%0A          + prefix  = "alb-logs"%0A        }%0A%0A      + subnet_mapping (known after apply)%0A    }%0A%0A  # module.alb.aws_lb_listener.alb_listener will be created%0A  + resource "aws_lb_listener" "alb_listener" {%0A      + arn                                                                   = (known after apply)%0A      + id                                                                    = (known after apply)%0A      + load_balancer_arn                                                     = (known after apply)%0A      + port                                                                  = 80%0A      + protocol                                                              = "HTTP"%0A      + region                                                                = "us-east-1"%0A      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)%0A      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)%0A      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)%0A      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)%0A      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)%0A      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)%0A      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)%0A      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)%0A      + routing_http_response_access_control_max_age_header_value             = (known after apply)%0A      + routing_http_response_content_security_policy_header_value            = (known after apply)%0A      + routing_http_response_server_enabled                                  = (known after apply)%0A      + routing_http_response_strict_transport_security_header_value          = (known after apply)%0A      + routing_http_response_x_content_type_options_header_value             = (known after apply)%0A      + routing_http_response_x_frame_options_header_value                    = (known after apply)%0A      + ssl_policy                                                            = (known after apply)%0A      + tags_all                                                              = (known after apply)%0A      + tcp_idle_timeout_seconds                                              = (known after apply)%0A%0A      + default_action {%0A          + order            = (known after apply)%0A          + target_group_arn = (known after apply)%0A          + type             = "forward"%0A        }%0A%0A      + mutual_authentication (known after apply)%0A    }%0A%0A  # module.alb.aws_lb_target_group.tg will be created%0A  + resource "aws_lb_target_group" "tg" {%0A      + arn                                = (known after apply)%0A      + arn_suffix                         = (known after apply)%0A      + connection_termination             = (known after apply)%0A      + deregistration_delay               = "300"%0A      + id                                 = (known after apply)%0A      + ip_address_type                    = (known after apply)%0A      + lambda_multi_value_headers_enabled = false%0A      + load_balancer_arns                 = (known after apply)%0A      + load_balancing_algorithm_type      = (known after apply)%0A      + load_balancing_anomaly_mitigation  = (known after apply)%0A      + load_balancing_cross_zone_enabled  = (known after apply)%0A      + name                               = "App-TG"%0A      + name_prefix                        = (known after apply)%0A      + port                               = 80%0A      + preserve_client_ip                 = (known after apply)%0A      + protocol                           = "HTTP"%0A      + protocol_version                   = (known after apply)%0A      + proxy_protocol_v2                  = false%0A      + region                             = "us-east-1"%0A      + slow_start                         = 0%0A      + tags                               = {%0A          + "Environment" = "dev"%0A          + "Name"        = "App-TG-dev"%0A          + "Owner"       = "Gursimran"%0A          + "Project"     = "terraform-aws-3tier-infra"%0A        }%0A      + tags_all                           = {%0A          + "Environment" = "dev"%0A          + "Name"        = "App-TG-dev"%0A          + "Owner"       = "Gursimran"%0A          + "Project"     = "terraform-aws-3tier-infra"%0A        }%0A      + target_type                        = "instance"%0A      + vpc_id                             = (known after apply)%0A%0A      + health_check {%0A          + enabled             = true%0A          + healthy_threshold   = 5%0A          + interval            = 30%0A          + matcher             = "200-399"%0A          + path                = "/"%0A          + port                = "traffic-port"%0A          + protocol            = "HTTP"%0A          + timeout             = 5%0A          + unhealthy_threshold = 2%0A        }%0A%0A      + stickiness (known after apply)%0A%0A      + target_failover (known after apply)%0A%0A      + target_group_health (known after apply)%0A%0A      + target_health_state (known after apply)%0A    }%0A%0A  # module.alb.aws_security_group.alb_sg will be created%0A  + resource "aws_security_group" "alb_sg" {%0A      + arn                    = (known after apply)%0A      + description            = "Security group for ALB"%0A      + egress                 = (known after apply)%0A      + id                     = (known after apply)%0A      + ingress                = (known after apply)%0A      + name                   = "ALB-SG"%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + region                 = "us-east-1"%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Environment" = "dev"%0A          + "Name"        = "ALB-SG-dev"%0A          + "Owner"       = "Gursimran"%0A          + "Project"     = "terraform-aws-3tier-infra"%0A        }%0A      + tags_all               = {%0A          + "Environment" = "dev"%0A          + "Name"        = "ALB-SG-dev"%0A          + "Owner"       = "Gursimran"%0A          + "Project"     = "terraform-aws-3tier-infra"%0A        }%0A      + vpc_id                 = (known after apply)%0A    }%0A%0A  # module.alb.aws_vpc_security_group_egress_rule.allow_http will be created%0A  + resource "aws_vpc_security_group_egress_rule" "allow_http" {%0A      + arn                          = (known after apply)%0A      + description                  = "Allow Outbound HTTP traffic from within ASG to ALB"%0A      + from_port                    = 80%0A      + id                           = (known after apply)%0A      + ip_protocol                  = "tcp"%0A      + referenced_security_group_id = (known after apply)%0A      + region                       = "us-east-1"%0A      + security_group_id            = (known after apply)%0A      + security_group_rule_id       = (known after apply)%0A      + tags_all                     = {}%0A      + to_port                      = 80%0A    }%0A%0A  # module.alb.aws_vpc_security_group_egress_rule.allow_https will be created%0A  + resource "aws_vpc_security_group_egress_rule" "allow_https" {%0A      + arn                          = (known after apply)%0A      + description                  = "Allow Outbound HTTPS traffic from within ASG to ALB"%0A      + from_port                    = 443%0A      + id                           = (known after apply)%0A      + ip_protocol                  = "tcp"%0A      + referenced_security_group_id = (known after apply)%0A      + region                       = "us-east-1"%0A      + security_group_id            = (known after apply)%0A      + security_group_rule_id       = (known after apply)%0A      + tags_all                     = {}%0A      + to_port                      = 443%0A    }%0A%0A  # module.alb.aws_vpc_security_group_ingress_rule.allow_http will be created%0A  + resource "aws_vpc_security_group_ingress_rule" "allow_http" {%0A      + arn                    = (known after apply)%0A      + cidr_ipv4              = "0.0.0.0/0"%0A      + description            = "Allow HTTP traffic from anywhere"%0A      + from_port              = 80%0A      + id                     = (known after apply)%0A      + ip_protocol            = "tcp"%0A      + region                 = "us-east-1"%0A      + security_group_id      = (known after apply)%0A      + security_group_rule_id = (known after apply)%0A      + tags_all               = {}%0A      + to_port                = 80%0A    }%0A%0A  # module.alb.aws_vpc_security_group_ingress_rule.allow_https will be created%0A  + resource "aws_vpc_security_group_ingress_rule" "allow_https" {%0A      + arn                    = (known after apply)%0A      + cidr_ipv4              = "0.0.0.0/0"%0A      + description            = "Allow HTTPS traffic from anywhere"%0A      + from_port              = 443%0A      + id                     = (known after apply)%0A      + ip_protocol            = "tcp"%0A      + region                 = "us-east-1"%0A      + security_group_id      = (known after apply)%0A      + security_group_rule_id = (known after apply)%0A      + tags_all               = {}%0A      + to_port                = 443%0A    }%0A%0A  # module.asg.aws_autoscaling_group.asg_app will be created%0A  + resource "aws_autoscaling_group" "asg_app" {%0A      + arn                              = (known after apply)%0A      + availability_zones               = (known after apply)%0A      + default_cooldown                 = (known after apply)%0A      + desired_capacity                 = 2%0A      + force_delete                     = false%0A      + force_delete_warm_pool           = false%0A      + health_check_grace_period        = 300%0A      + health_check_type                = "ELB"%0A      + id                               = (known after apply)%0A      + ignore_failed_scaling_activities = false%0A      + load_balancers                   = (known after apply)%0A      + max_size                         = 4%0A      + metrics_granularity              = "1Minute"%0A      + min_size                         = 2%0A      + name                             = (known after apply)%0A      + name_prefix                      = (known after apply)%0A      + predicted_capacity               = (known after apply)%0A      + protect_from_scale_in            = false%0A      + region                           = "us-east-1"%0A      + service_linked_role_arn          = (known after apply)%0A      + target_group_arns                = (known after apply)%0A      + vpc_zone_identifier              = (known after apply)%0A      + wait_for_capacity_timeout        = "10m"%0A      + warm_pool_size                   = (known after apply)%0A%0A      + availability_zone_distribution (known after apply)%0A%0A      + capacity_reservation_specification (known after apply)%0A%0A      + launch_template {%0A          + id      = (known after apply)%0A          + name    = (known after apply)%0A          + version = "$Latest"%0A        }%0A%0A      + mixed_instances_policy (known after apply)%0A%0A      + traffic_source (known after apply)%0A    }%0A%0A  # module.asg.aws_launch_template.application will be created%0A  + resource "aws_launch_template" "application" {%0A      + arn             = (known after apply)%0A      + default_version = (known after apply)%0A      + id              = (known after apply)%0A      + image_id        = "ami-07c1fa5792ef8fe27"%0A      + instance_type   = "t2.micro"%0A      + key_name        = "my-ec2-key"%0A      + latest_version  = (known after apply)%0A      + name            = (known after apply)%0A      + name_prefix     = "APP-Launch-Template"%0A      + region          = "us-east-1"%0A      + tags            = {%0A          + "Environment" = "dev"%0A          + "Name"        = "ASG-LT-dev"%0A          + "Owner"       = "Gursimran"%0A          + "Project"     = "terraform-aws-3tier-infra"%0A        }%0A      + tags_all        = {%0A          + "Environment" = "dev"%0A          + "Name"        = "ASG-LT-dev"%0A          + "Owner"       = "Gursimran"%0A          + "Project"     = "terraform-aws-3tier-infra"%0A        }%0A      + user_data       = "IyEvYmluL2Jhc2gKc2V0IC1lCgojIFVwZGF0ZSBwYWNrYWdlcwpkbmYgdXBkYXRlIC15CgojIEluc3RhbGwgYW5kIHN0YXJ0IE5HSU5YCmRuZiBpbnN0YWxsIC15IG5naW54IC0tYWxsb3dlcmFzaW5nCnN5c3RlbWN0bCBlbmFibGUgbmdpbngKc3lzdGVtY3RsIHN0YXJ0IG5naW54CgojIEluc3RhbGwgQ2xvdWRXYXRjaCBBZ2VudApkbmYgaW5zdGFsbCAteSBhbWF6b24tY2xvdWR3YXRjaC1hZ2VudAoKIyBHZXQgaW5zdGFuY2UgSUQKSU5TVEFOQ0VfSUQ9JChjdXJsIC1zIGh0dHA6Ly8xNjkuMjU0LjE2OS4yNTQvbGF0ZXN0L21ldGEtZGF0YS9pbnN0YW5jZS1pZCkKCiMgQ2xvdWRXYXRjaCBjb25maWcKY2F0IDw8RU9UID4gL29wdC9hd3MvYW1hem9uLWNsb3Vkd2F0Y2gtYWdlbnQvZXRjL2FtYXpvbi1jbG91ZHdhdGNoLWFnZW50Lmpzb24KewogICJsb2dzIjogewogICAgImxvZ3NfY29sbGVjdGVkIjogewogICAgICAiZmlsZXMiOiB7CiAgICAgICAgImNvbGxlY3RfbGlzdCI6IFsKICAgICAgICAgIHsKICAgICAgICAgICAgImZpbGVfcGF0aCI6ICIvdmFyL2xvZy9uZ2lueC9hY2Nlc3MubG9nIiwKICAgICAgICAgICAgImxvZ19ncm91cF9uYW1lIjogIi9lYzIvYXNnLWFwcC1kZXYiLAogICAgICAgICAgICAibG9nX3N0cmVhbV9uYW1lIjogIntJTlNUQU5DRV9JRH0tbmdpbngtYWNjZXNzIgogICAgICAgICAgfSwKICAgICAgICAgIHsKICAgICAgICAgICAgImZpbGVfcGF0aCI6ICIvdmFyL2xvZy9uZ2lueC9lcnJvci5sb2ciLAogICAgICAgICAgICAibG9nX2dyb3VwX25hbWUiOiAiL2VjMi9hc2ctYXBwLWRldiIsCiAgICAgICAgICAgICJsb2dfc3RyZWFtX25hbWUiOiAie0lOU1RBTkNFX0lEfS1uZ2lueC1lcnJvciIKICAgICAgICAgIH0KICAgICAgICBdCiAgICAgIH0KICAgIH0KICB9Cn0KRU9UCgojIEVuYWJsZSBDbG91ZFdhdGNoIEFnZW50CnN5c3RlbWN0bCBlbmFibGUgYW1hem9uLWNsb3Vkd2F0Y2gtYWdlbnQKc3lzdGVtY3RsIHN0YXJ0IGFtYXpvbi1jbG91ZHdhdGNoLWFnZW50CgojIEVuc3VyZSBTU00gQWdlbnQgaXMgaW5zdGFsbGVkIChhbHJlYWR5IHByZXNlbnQgb24gQUwyMDIzLCBidXQganVzdCBpbiBjYXNlKQpkbmYgaW5zdGFsbCAteSBhbWF6b24tc3NtLWFnZW50IHx8IHRydWUKc3lzdGVtY3RsIGVuYWJsZSBhbWF6b24tc3NtLWFnZW50CnN5c3RlbWN0bCBzdGFydCBhbWF6b24tc3NtLWFnZW50Cg=="%0A%0A      + iam_instance_profile {%0A          + arn = (known after apply)%0A        }%0A%0A      + metadata_options (known after apply)%0A%0A      + network_interfaces {%0A          + associate_public_ip_address = "false"%0A          + security_groups             = (known after apply)%0A        }%0A    }%0A%0A  # module.asg.aws_security_group.asg_sg will be created%0A  + resource "aws_security_group" "asg_sg" {%0A      + arn                    = (known after apply)%0A      + description            = "Security group for ASG application instances"%0A      + egress                 = (known after apply)%0A      + id                     = (known after apply)%0A      + ingress                = (known after apply)%0A      + name                   = "asg_app_sg"%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + region                 = "us-east-1"%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Environment" = "dev"%0A          + "Name"        = "asg_app_sg-dev"%0A          + "Owner"       = "Gursimran"%0A          + "Project"     = "terraform-aws-3tier-infra"%0A        }%0A      + tags_all               = {%0A          + "Environment" = "dev"%0A          + "Name"        = "asg_app_sg-dev"%0A          + "Owner"       = "Gursimran"%0A          + "Project"     = "terraform-aws-3tier-infra"%0A        }%0A      + vpc_id                 = (known after apply)%0A    }%0A%0A  # module.asg.aws_vpc_security_group_egress_rule.allow_http will be created%0A  + resource "aws_vpc_security_group_egress_rule" "allow_http" {%0A      + arn                    = (known after apply)%0A      + cidr_ipv4              = "0.0.0.0/0"%0A      + description            = "Allow HTTP traffic outbound to connect to NAT"%0A      + from_port              = 80%0A      + id                     = (known after apply)%0A      + ip_protocol            = "tcp"%0A      + region                 = "us-east-1"%0A      + security_group_id      = (known after apply)%0A      + security_group_rule_id = (known after apply)%0A      + tags_all               = {}%0A      + to_port                = 80%0A    }%0A%0A  # module.asg.aws_vpc_security_group_egress_rule.allow_https will be created%0A  + resource "aws_vpc_security_group_egress_rule" "allow_https" {%0A      + arn                    = (known after apply)%0A      + cidr_ipv4              = "0.0.0.0/0"%0A      + description            = "Allow HTTPS traffic outbound to connect to NAT"%0A      + from_port              = 443%0A      + id                     = (known after apply)%0A      + ip_protocol            = "tcp"%0A      + region                 = "us-east-1"%0A      + security_group_id      = (known after apply)%0A      + security_group_rule_id = (known after apply)%0A      + tags_all               = {}%0A      + to_port                = 443%0A    }%0A%0A  # module.asg.aws_vpc_security_group_ingress_rule.allow_http will be created%0A  + resource "aws_vpc_security_group_ingress_rule" "allow_http" {%0A      + arn                          = (known after apply)%0A      + description                  = "Allow HTTP traffic from within ASG to ALB"%0A      + from_port                    = 80%0A      + id                           = (known after apply)%0A      + ip_protocol                  = "tcp"%0A      + referenced_security_group_id = (known after apply)%0A      + region                       = "us-east-1"%0A      + security_group_id            = (known after apply)%0A      + security_group_rule_id       = (known after apply)%0A      + tags_all                     = {}%0A      + to_port                      = 80%0A    }%0A%0A  # module.asg.aws_vpc_security_group_ingress_rule.allow_https will be created%0A  + resource "aws_vpc_security_group_ingress_rule" "allow_https" {%0A      + arn                          = (known after apply)%0A      + description                  = "Allow HTTPS traffic from within ASG to ALB"%0A      + from_port                    = 443%0A      + id                           = (known after apply)%0A      + ip_protocol                  = "tcp"%0A      + referenced_security_group_id = (known after apply)%0A      + region                       = "us-east-1"%0A      + security_group_id            = (known after apply)%0A      + security_group_rule_id       = (known after apply)%0A      + tags_all                     = {}%0A      + to_port                      = 443%0A    }%0A%0A  # module.dns.aws_route53_record.root will be created%0A  + resource "aws_route53_record" "root" {%0A      + allow_overwrite = (known after apply)%0A      + fqdn            = (known after apply)%0A      + id              = (known after apply)%0A      + name            = "dev.singhops.net"%0A      + type            = "A"%0A      + zone_id         = "Z0111471Z8E165DEP1B"%0A%0A      + alias {%0A          + evaluate_target_health = true%0A          + name                   = (known after apply)%0A          + zone_id                = (known after apply)%0A        }%0A    }%0A%0A  # module.iam.aws_iam_instance_profile.ec2_instance_profile will be created%0A  + resource "aws_iam_instance_profile" "ec2_instance_profile" {%0A      + arn         = (known after apply)%0A      + create_date = (known after apply)%0A      + id          = (known after apply)%0A      + name        = "EC2InstanceProfile-dev"%0A      + name_prefix = (known after apply)%0A      + path        = "/"%0A      + role        = "ec2-role-dev"%0A      + tags_all    = (known after apply)%0A      + unique_id   = (known after apply)%0A    }%0A%0A  # module.iam.aws_iam_policy.ssm_db_access will be created%0A  + resource "aws_iam_policy" "ssm_db_access" {%0A      + arn              = (known after apply)%0A      + attachment_count = (known after apply)%0A      + description      = "Allow EC2 to read DB password from SSM Parameter Store"%0A      + id               = (known after apply)%0A      + name             = "ssm-db-access-dev"%0A      + name_prefix      = (known after apply)%0A      + path             = "/"%0A      + policy           = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = [%0A                          + "ssm:GetParameter",%0A                          + "ssm:GetParameters",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "arn:aws:ssm:us-east-1:789103393231:parameter/dev/db/password"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + policy_id        = (known after apply)%0A      + tags_all         = (known after apply)%0A    }%0A%0A  # module.iam.aws_iam_role.ec2_role will be created%0A  + resource "aws_iam_role" "ec2_role" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "ec2.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "ec2-role-dev"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags                  = {%0A          + "Environment" = "dev"%0A          + "Name"        = "EC2Role-dev"%0A          + "Owner"       = "Gursimran"%0A          + "Project"     = "terraform-aws-3tier-infra"%0A        }%0A      + tags_all              = {%0A          + "Environment" = "dev"%0A          + "Name"        = "EC2Role-dev"%0A          + "Owner"       = "Gursimran"%0A          + "Project"     = "terraform-aws-3tier-infra"%0A        }%0A      + unique_id             = (known after apply)%0A%0A      + inline_policy (known after apply)%0A    }%0A%0A  # module.iam.aws_iam_role_policy_attachment.attach_ssm_db_access will be created%0A  + resource "aws_iam_role_policy_attachment" "attach_ssm_db_access" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = "ec2-role-dev"%0A    }%0A%0A  # module.iam.aws_iam_role_policy_attachment.cw will be created%0A  + resource "aws_iam_role_policy_attachment" "cw" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/CloudWatchAgentServerPolicy"%0A      + role       = "ec2-role-dev"%0A    }%0A%0A  # module.iam.aws_iam_role_policy_attachment.ssm_attach will be created%0A  + resource "aws_iam_role_policy_attachment" "ssm_attach" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"%0A      + role       = "ec2-role-dev"%0A    }%0A%0A  # module.monitoring.aws_cloudwatch_log_group.asg_log_group will be created%0A  + resource "aws_cloudwatch_log_group" "asg_log_group" {%0A      + arn               = (known after apply)%0A      + id                = (known after apply)%0A      + log_group_class   = (known after apply)%0A      + name              = "/ec2/asg-app-dev"%0A      + name_prefix       = (known after apply)%0A      + region            = "us-east-1"%0A      + retention_in_days = 30%0A      + skip_destroy      = false%0A      + tags              = {%0A          + "Environment" = "dev"%0A          + "Name"        = "ASG-App-LogGroup-dev"%0A          + "Owner"       = "Gursimran"%0A          + "Project"     = "terraform-aws-3tier-infra"%0A        }%0A      + tags_all          = {%0A          + "Environment" = "dev"%0A          + "Name"        = "ASG-App-LogGroup-dev"%0A          + "Owner"       = "Gursimran"%0A          + "Project"     = "terraform-aws-3tier-infra"%0A        }%0A    }%0A%0A  # module.monitoring.aws_s3_bucket.alb_logs will be created%0A  + resource "aws_s3_bucket" "alb_logs" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = (known after apply)%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_prefix               = (known after apply)%0A      + bucket_region               = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = true%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = "us-east-1"%0A      + request_payer               = (known after apply)%0A      + tags                        = {%0A          + "Environment" = "dev"%0A          + "Name"        = "ALB-Logs-dev"%0A          + "Owner"       = "Gursimran"%0A          + "Project"     = "terraform-aws-3tier-infra"%0A        }%0A      + tags_all                    = {%0A          + "Environment" = "dev"%0A          + "Name"        = "ALB-Logs-dev"%0A          + "Owner"       = "Gursimran"%0A          + "Project"     = "terraform-aws-3tier-infra"%0A        }%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A%0A      + cors_rule (known after apply)%0A%0A      + grant (known after apply)%0A%0A      + lifecycle_rule (known after apply)%0A%0A      + logging (known after apply)%0A%0A      + object_lock_configuration (known after apply)%0A%0A      + replication_configuration (known after apply)%0A%0A      + server_side_encryption_configuration (known after apply)%0A%0A      + versioning (known after apply)%0A%0A      + website (known after apply)%0A    }%0A%0A  # module.monitoring.aws_s3_bucket_policy.alb_logs will be created%0A  + resource "aws_s3_bucket_policy" "alb_logs" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A      + policy = (known after apply)%0A      + region = "us-east-1"%0A    }%0A%0A  # module.monitoring.random_id.bucket_id will be created%0A  + resource "random_id" "bucket_id" {%0A      + b64_std     = (known after apply)%0A      + b64_url     = (known after apply)%0A      + byte_length = 6%0A      + dec         = (known after apply)%0A      + hex         = (known after apply)%0A      + id          = (known after apply)%0A    }%0A%0A  # module.vpc.aws_eip.nat_eip["us-east-1a"] will be created%0A  + resource "aws_eip" "nat_eip" {%0A      + allocation_id        = (known after apply)%0A      + arn                  = (known after apply)%0A      + association_id       = (known after apply)%0A      + carrier_ip           = (known after apply)%0A      + customer_owned_ip    = (known after apply)%0A      + domain               = "vpc"%0A      + id                   = (known after apply)%0A      + instance             = (known after apply)%0A      + ipam_pool_id         = (known after apply)%0A      + network_border_group = (known after apply)%0A      + network_interface    = (known after apply)%0A      + private_dns          = (known after apply)%0A      + private_ip           = (known after apply)%0A      + ptr_record           = (known after apply)%0A      + public_dns           = (known after apply)%0A      + public_ip            = (known after apply)%0A      + public_ipv4_pool     = (known after apply)%0A      + region               = "us-east-1"%0A      + tags                 = {%0A          + "Environment" = "dev"%0A          + "Name"        = "NatEIP-us-east-1a-dev"%0A          + "Owner"       = "Gursimran"%0A          + "Project"     = "terraform-aws-3tier-infra"%0A        }%0A      + tags_all             = {%0A          + "Environment" = "dev"%0A          + "Name"        = "NatEIP-us-east-1a-dev"%0A          + "Owner"       = "Gursimran"%0A          + "Project"     = "terraform-aws-3tier-infra"%0A        }%0A    }%0A%0A  # module.vpc.aws_eip.nat_eip["us-east-1b"] will be created%0A  + resource "aws_eip" "nat_eip" {%0A      + allocation_id        = (known after apply)%0A      + arn                  = (known after apply)%0A      + association_id       = (known after apply)%0A      + carrier_ip           = (known after apply)%0A      + customer_owned_ip    = (known after apply)%0A      + domain               = "vpc"%0A      + id                   = (known after apply)%0A      + instance             = (known after apply)%0A      + ipam_pool_id         = (known after apply)%0A      + network_border_group = (known after apply)%0A      + network_interface    = (known after apply)%0A      + private_dns          = (known after apply)%0A      + private_ip           = (known after apply)%0A      + ptr_record           = (known after apply)%0A      + public_dns           = (known after apply)%0A      + public_ip            = (known after apply)%0A      + public_ipv4_pool     = (known after apply)%0A      + region               = "us-east-1"%0A      + tags                 = {%0A          + "Environment" = "dev"%0A          + "Name"        = "NatEIP-us-east-1b-dev"%0A          + "Owner"       = "Gursimran"%0A          + "Project"     = "terraform-aws-3tier-infra"%0A        }%0A      + tags_all             = {%0A          + "Environment" = "dev"%0A          + "Name"        = "NatEIP-us-east-1b-dev"%0A          + "Owner"       = "Gursimran"%0A          + "Project"     = "terraform-aws-3tier-infra"%0A        }%0A    }%0A%0A  # module.vpc.aws_internet_gateway.igw will be created%0A  + resource "aws_internet_gateway" "igw" {%0A      + arn      = (known after apply)%0A      + id       = (known after apply)%0A      + owner_id = (known after apply)%0A      + region   = "us-east-1"%0A      + tags     = {%0A          + "Environment" = "dev"%0A          + "Name"        = "IGW-VPCji-dev"%0A          + "Owner"       = "Gursimran"%0A          + "Project"     = "terraform-aws-3tier-infra"%0A        }%0A      + tags_all = {%0A          + "Environment" = "dev"%0A          + "Name"        = "IGW-VPCji-dev"%0A          + "Owner"       = "Gursimran"%0A          + "Project"     = "terraform-aws-3tier-infra"%0A        }%0A      + vpc_id   = (known after apply)%0A    }%0A%0A  # module.vpc.aws_nat_gateway.nat_gw["us-east-1a"] will be created%0A  + resource "aws_nat_gateway" "nat_gw" {%0A      + allocation_id                      = (known after apply)%0A      + association_id                     = (known after apply)%0A      + connectivity_type                  = "public"%0A      + id                                 = (known after apply)%0A      + network_interface_id               = (known after apply)%0A      + private_ip                         = (known after apply)%0A      + public_ip                          = (known after apply)%0A      + region                             = "us-east-1"%0A      + secondary_allocation_ids           = (known after apply)%0A      + secondary_private_ip_address_count = (known after apply)%0A      + secondary_private_ip_addresses     = (known after apply)%0A      + subnet_id                          = (known after apply)%0A      + tags                               = {%0A          + "Environment" = "dev"%0A          + "Name"        = "NatGW-us-east-1a-dev"%0A          + "Owner"       = "Gursimran"%0A          + "Project"     = "terraform-aws-3tier-infra"%0A        }%0A      + tags_all                           = {%0A          + "Environment" = "dev"%0A          + "Name"        = "NatGW-us-east-1a-dev"%0A          + "Owner"       = "Gursimran"%0A          + "Project"     = "terraform-aws-3tier-infra"%0A        }%0A    }%0A%0A  # module.vpc.aws_nat_gateway.nat_gw["us-east-1b"] will be created%0A  + resource "aws_nat_gateway" "nat_gw" {%0A      + allocation_id                      = (known after apply)%0A      + association_id                     = (known after apply)%0A      + connectivity_type                  = "public"%0A      + id                                 = (known after apply)%0A      + network_interface_id               = (known after apply)%0A      + private_ip                         = (known after apply)%0A      + public_ip                          = (known after apply)%0A      + region                             = "us-east-1"%0A      + secondary_allocation_ids           = (known after apply)%0A      + secondary_private_ip_address_count = (known after apply)%0A      + secondary_private_ip_addresses     = (known after apply)%0A      + subnet_id                          = (known after apply)%0A      + tags                               = {%0A          + "Environment" = "dev"%0A          + "Name"        = "NatGW-us-east-1b-dev"%0A          + "Owner"       = "Gursimran"%0A          + "Project"     = "terraform-aws-3tier-infra"%0A        }%0A      + tags_all                           = {%0A          + "Environment" = "dev"%0A          + "Name"        = "NatGW-us-east-1b-dev"%0A          + "Owner"       = "Gursimran"%0A          + "Project"     = "terraform-aws-3tier-infra"%0A        }%0A    }%0A%0A  # module.vpc.aws_route.app_rt_route["us-east-1a"] will be created%0A  + resource "aws_route" "app_rt_route" {%0A      + destination_cidr_block = "0.0.0.0/0"%0A      + id                     = (known after apply)%0A      + instance_id            = (known after apply)%0A      + instance_owner_id      = (known after apply)%0A      + nat_gateway_id         = (known after apply)%0A      + network_interface_id   = (known after apply)%0A      + origin                 = (known after apply)%0A      + region                 = "us-east-1"%0A      + route_table_id         = (known after apply)%0A      + state                  = (known after apply)%0A    }%0A%0A  # module.vpc.aws_route.app_rt_route["us-east-1b"] will be created%0A  + resource "aws_route" "app_rt_route" {%0A      + destination_cidr_block = "0.0.0.0/0"%0A      + id                     = (known after apply)%0A      + instance_id            = (known after apply)%0A      + instance_owner_id      = (known after apply)%0A      + nat_gateway_id         = (known after apply)%0A      + network_interface_id   = (known after apply)%0A      + origin                 = (known after apply)%0A      + region                 = "us-east-1"%0A      + route_table_id         = (known after apply)%0A      + state                  = (known after apply)%0A    }%0A%0A  # module.vpc.aws_route.public_rt_route will be created%0A  + resource "aws_route" "public_rt_route" {%0A      + destination_cidr_block = "0.0.0.0/0"%0A      + gateway_id             = (known after apply)%0A      + id                     = (known after apply)%0A      + instance_id            = (known after apply)%0A      + instance_owner_id      = (known after apply)%0A      + network_interface_id   = (known after apply)%0A      + origin                 = (known after apply)%0A      + region                 = "us-east-1"%0A      + route_table_id         = (known after apply)%0A      + state                  = (known after apply)%0A    }%0A%0A  # module.vpc.aws_route_table.app_rt["us-east-1a"] will be created%0A  + resource "aws_route_table" "app_rt" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + region           = "us-east-1"%0A      + route            = (known after apply)%0A      + tags             = {%0A          + "Environment" = "dev"%0A          + "Name"        = "AppRT-us-east-1a-dev"%0A          + "Owner"       = "Gursimran"%0A          + "Project"     = "terraform-aws-3tier-infra"%0A        }%0A      + tags_all         = {%0A          + "Environment" = "dev"%0A          + "Name"        = "AppRT-us-east-1a-dev"%0A          + "Owner"       = "Gursimran"%0A          + "Project"     = "terraform-aws-3tier-infra"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # module.vpc.aws_route_table.app_rt["us-east-1b"] will be created%0A  + resource "aws_route_table" "app_rt" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + region           = "us-east-1"%0A      + route            = (known after apply)%0A      + tags             = {%0A          + "Environment" = "dev"%0A          + "Name"        = "AppRT-us-east-1b-dev"%0A          + "Owner"       = "Gursimran"%0A          + "Project"     = "terraform-aws-3tier-infra"%0A        }%0A      + tags_all         = {%0A          + "Environment" = "dev"%0A          + "Name"        = "AppRT-us-east-1b-dev"%0A          + "Owner"       = "Gursimran"%0A          + "Project"     = "terraform-aws-3tier-infra"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # module.vpc.aws_route_table.db_rt["us-east-1a"] will be created%0A  + resource "aws_route_table" "db_rt" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + region           = "us-east-1"%0A      + route            = (known after apply)%0A      + tags             = {%0A          + "Environment" = "dev"%0A          + "Name"        = "DBRT-us-east-1a-dev"%0A          + "Owner"       = "Gursimran"%0A          + "Project"     = "terraform-aws-3tier-infra"%0A        }%0A      + tags_all         = {%0A          + "Environment" = "dev"%0A          + "Name"        = "DBRT-us-east-1a-dev"%0A          + "Owner"       = "Gursimran"%0A          + "Project"     = "terraform-aws-3tier-infra"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # module.vpc.aws_route_table.db_rt["us-east-1b"] will be created%0A  + resource "aws_route_table" "db_rt" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + region           = "us-east-1"%0A      + route            = (known after apply)%0A      + tags             = {%0A          + "Environment" = "dev"%0A          + "Name"        = "DBRT-us-east-1b-dev"%0A          + "Owner"       = "Gursimran"%0A          + "Project"     = "terraform-aws-3tier-infra"%0A        }%0A      + tags_all         = {%0A          + "Environment" = "dev"%0A          + "Name"        = "DBRT-us-east-1b-dev"%0A          + "Owner"       = "Gursimran"%0A          + "Project"     = "terraform-aws-3tier-infra"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # module.vpc.aws_route_table.public_rt will be created%0A  + resource "aws_route_table" "public_rt" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + region           = "us-east-1"%0A      + route            = (known after apply)%0A      + tags             = {%0A          + "Environment" = "dev"%0A          + "Name"        = "PublicRT-dev"%0A          + "Owner"       = "Gursimran"%0A          + "Project"     = "terraform-aws-3tier-infra"%0A        }%0A      + tags_all         = {%0A          + "Environment" = "dev"%0A          + "Name"        = "PublicRT-dev"%0A          + "Owner"       = "Gursimran"%0A          + "Project"     = "terraform-aws-3tier-infra"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # module.vpc.aws_route_table_association.app_rt_assoc["us-east-1a"] will be created%0A  + resource "aws_route_table_association" "app_rt_assoc" {%0A      + id             = (known after apply)%0A      + region         = "us-east-1"%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.vpc.aws_route_table_association.app_rt_assoc["us-east-1b"] will be created%0A  + resource "aws_route_table_association" "app_rt_assoc" {%0A      + id             = (known after apply)%0A      + region         = "us-east-1"%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.vpc.aws_route_table_association.db_rt_assoc["us-east-1a"] will be created%0A  + resource "aws_route_table_association" "db_rt_assoc" {%0A      + id             = (known after apply)%0A      + region         = "us-east-1"%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.vpc.aws_route_table_association.db_rt_assoc["us-east-1b"] will be created%0A  + resource "aws_route_table_association" "db_rt_assoc" {%0A      + id             = (known after apply)%0A      + region         = "us-east-1"%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.vpc.aws_route_table_association.public_rt_assoc["us-east-1a"] will be created%0A  + resource "aws_route_table_association" "public_rt_assoc" {%0A      + id             = (known after apply)%0A      + region         = "us-east-1"%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.vpc.aws_route_table_association.public_rt_assoc["us-east-1b"] will be created%0A  + resource "aws_route_table_association" "public_rt_assoc" {%0A      + id             = (known after apply)%0A      + region         = "us-east-1"%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.vpc.aws_subnet.app_subnets["us-east-1a"] will be created%0A  + resource "aws_subnet" "app_subnets" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.3.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + region                                         = "us-east-1"%0A      + tags                                           = {%0A          + "Environment" = "dev"%0A          + "Name"        = "AppSubnet-us-east-1a-dev"%0A          + "Owner"       = "Gursimran"%0A          + "Project"     = "terraform-aws-3tier-infra"%0A        }%0A      + tags_all                                       = {%0A          + "Environment" = "dev"%0A          + "Name"        = "AppSubnet-us-east-1a-dev"%0A          + "Owner"       = "Gursimran"%0A          + "Project"     = "terraform-aws-3tier-infra"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.vpc.aws_subnet.app_subnets["us-east-1b"] will be created%0A  + resource "aws_subnet" "app_subnets" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1b"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.4.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + region                                         = "us-east-1"%0A      + tags                                           = {%0A          + "Environment" = "dev"%0A          + "Name"        = "AppSubnet-us-east-1b-dev"%0A          + "Owner"       = "Gursimran"%0A          + "Project"     = "terraform-aws-3tier-infra"%0A        }%0A      + tags_all                                       = {%0A          + "Environment" = "dev"%0A          + "Name"        = "AppSubnet-us-east-1b-dev"%0A          + "Owner"       = "Gursimran"%0A          + "Project"     = "terraform-aws-3tier-infra"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.vpc.aws_subnet.db_subnets["us-east-1a"] will be created%0A  + resource "aws_subnet" "db_subnets" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.5.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + region                                         = "us-east-1"%0A      + tags                                           = {%0A          + "Environment" = "dev"%0A          + "Name"        = "DBSubnet-us-east-1a-dev"%0A          + "Owner"       = "Gursimran"%0A          + "Project"     = "terraform-aws-3tier-infra"%0A        }%0A      + tags_all                                       = {%0A          + "Environment" = "dev"%0A          + "Name"        = "DBSubnet-us-east-1a-dev"%0A          + "Owner"       = "Gursimran"%0A          + "Project"     = "terraform-aws-3tier-infra"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.vpc.aws_subnet.db_subnets["us-east-1b"] will be created%0A  + resource "aws_subnet" "db_subnets" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1b"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.6.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + region                                         = "us-east-1"%0A      + tags                                           = {%0A          + "Environment" = "dev"%0A          + "Name"        = "DBSubnet-us-east-1b-dev"%0A          + "Owner"       = "Gursimran"%0A          + "Project"     = "terraform-aws-3tier-infra"%0A        }%0A      + tags_all                                       = {%0A          + "Environment" = "dev"%0A          + "Name"        = "DBSubnet-us-east-1b-dev"%0A          + "Owner"       = "Gursimran"%0A          + "Project"     = "terraform-aws-3tier-infra"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.vpc.aws_subnet.public_subnets["us-east-1a"] will be created%0A  + resource "aws_subnet" "public_subnets" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.1.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = true%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + region                                         = "us-east-1"%0A      + tags                                           = {%0A          + "Environment" = "dev"%0A          + "Name"        = "PublicSubnet-us-east-1a-dev"%0A          + "Owner"       = "Gursimran"%0A          + "Project"     = "terraform-aws-3tier-infra"%0A        }%0A      + tags_all                                       = {%0A          + "Environment" = "dev"%0A          + "Name"        = "PublicSubnet-us-east-1a-dev"%0A          + "Owner"       = "Gursimran"%0A          + "Project"     = "terraform-aws-3tier-infra"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.vpc.aws_subnet.public_subnets["us-east-1b"] will be created%0A  + resource "aws_subnet" "public_subnets" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1b"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.2.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = true%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + region                                         = "us-east-1"%0A      + tags                                           = {%0A          + "Environment" = "dev"%0A          + "Name"        = "PublicSubnet-us-east-1b-dev"%0A          + "Owner"       = "Gursimran"%0A          + "Project"     = "terraform-aws-3tier-infra"%0A        }%0A      + tags_all                                       = {%0A          + "Environment" = "dev"%0A          + "Name"        = "PublicSubnet-us-east-1b-dev"%0A          + "Owner"       = "Gursimran"%0A          + "Project"     = "terraform-aws-3tier-infra"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.vpc.aws_vpc.main will be created%0A  + resource "aws_vpc" "main" {%0A      + arn                                  = (known after apply)%0A      + cidr_block                           = "10.0.0.0/16"%0A      + default_network_acl_id               = (known after apply)%0A      + default_route_table_id               = (known after apply)%0A      + default_security_group_id            = (known after apply)%0A      + dhcp_options_id                      = (known after apply)%0A      + enable_dns_hostnames                 = true%0A      + enable_dns_support                   = true%0A      + enable_network_address_usage_metrics = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_tenancy                     = "default"%0A      + ipv6_association_id                  = (known after apply)%0A      + ipv6_cidr_block                      = (known after apply)%0A      + ipv6_cidr_block_network_border_group = (known after apply)%0A      + main_route_table_id                  = (known after apply)%0A      + owner_id                             = (known after apply)%0A      + region                               = "us-east-1"%0A      + tags                                 = {%0A          + "Environment" = "dev"%0A          + "Name"        = "VPCji-dev"%0A          + "Owner"       = "Gursimran"%0A          + "Project"     = "terraform-aws-3tier-infra"%0A        }%0A      + tags_all                             = {%0A          + "Environment" = "dev"%0A          + "Name"        = "VPCji-dev"%0A          + "Owner"       = "Gursimran"%0A          + "Project"     = "terraform-aws-3tier-infra"%0A        }%0A    }%0A%0APlan: 52 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + Domain_Website = (known after apply)%0A  + alb_website    = (known after apply)%0A  + cw_log_group   = "/ec2/asg-app-dev"%0A  + iam_profile    = (known after apply)%0A  + rds_endpoint   = "RDS not created"%0A  + s3_bucket_name = (known after apply)%0A  + vpc_id         = (known after apply)%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

*Pusher: @gursimran531, Action: `pull_request`*